gestion/controllers/ClienteController.php

    protected function findModel($id)
    {
        if (($model = Cliente::findOne($id)) !== null) {
---
SELECT * FROM `cliente` WHERE `id`='1'

    private function agregarProductos($newIDs,$modelCliente)
    {
      $rol = $modelCliente->getClienteRol();
      foreach ($newIDs as $nuevoID){                // -- Creo la nueva relacion Cliente - Producto
          $productoRol = new ProductoRol();
          $productoRol->producto_id = $nuevoID;
          $productoRol->rol_id = $rol->id;
          if (!$productoRol->save()) {
            throw new Exception('No se pudo agrega el producto al cliente');
          }
          $pubicProduct = ProductoRol::find()->where(['producto_id' => $nuevoID, 'rol_id' => Rol::DEFAULTROLID])->one();
          if (!empty($pubicProduct)){ //Si estaba publico,lo borro, para ser consistente con la base de datos de Woocomerce
            $pubicProduct->delete();
          }
          if (!empty($modelCliente->web_customer_id)){     //-- Seteo los roles nuevos para los productos web
            $producto = Producto::find()->where(['id' => $nuevoID])->one();
---
INSERT INTO `producto_rol` (`producto_id`, `rol_id`) VALUES (1, 2)
DELETE FROM `producto_rol` WHERE `id`=1
SELECT EXISTS(SELECT * FROM `producto` WHERE (`producto`.`id`=1))
SELECT * FROM `producto` WHERE `id`=1