gestion/controllers/PedidoController.php

INSERT INTO `pedido` (`cliente_id`, `fecha_entrega`, `ship_city`, `ship_postcode`, `ship_address_1`) VALUES (5, '2018-00-15', 'Buenos Aires', 'C1010', 'Lavalle 441 ')
---
    public function actionCreate()
    {
        $modelPedido = new Pedido();
        $modelsPedidoDetalle = [new PedidoDetalle];
        $total = 0; //Cálculo de total de pedido
        $error = null;

        if ($modelPedido->load(Yii::$app->request->post())) {

            $modelsPedidoDetalle = PedidoDetalle::createMultiple(PedidoDetalle::classname(), $modelsPedidoDetalle );

SELECT * FROM `cliente_rol` WHERE `cliente_id`='3'
SELECT * FROM `producto` WHERE `id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
---
	public function actionProductosPorCliente($clienteId, $q=null)
    {
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $out = [];
        $rolId = [];
        $rolesId = ClienteRol::find()->where(['cliente_id' => $clienteId])->all();
        foreach ($rolesId as $rol ) {
            $rolId[] =  $rol->rol_id;
        }
        if (!empty($rolId)){
            $productosRol = ProductoRol::find()->where(['in','rol_id', $rolesId])->all();
            $pr = [];
            foreach ($productosRol as $productoRol) {
                if (!in_array($productoRol->producto_id, $pr) ) {
                    $pr[] =  $productoRol->producto_id;
                }
            }
            if (!is_null($q)) {
                $productos = Producto::find()->Where(['in','id', $pr])
                                            ->andFilterWhere(['like', 'nombre', $q])->all();
            }
            else {
                $productos = Producto::find()->Where(['in','id', $pr])->all();

SELECT `direccion` FROM `cliente` WHERE `id`=3
---
    public function actionGetClienteDireccion()
    {
        $id = (int) Yii::$app->request->getQueryParam('id');
        $cliente = Cliente::find()->select('direccion')->where(['id' => $id])->one();