gestion/views/cliente/_form_update.php

                        <div class="row">
                                <div class="col-sm-6">
                            <?php
                                $productos = Producto::find()->all();
---
SELECT * FROM `producto`