gestion/views/pedido/_form.php

  <div class="row">
    <div class="col-sm-6">
        <?php
            $clientes = Cliente::find()->all();
---
SELECT * FROM `cliente`

                      <div class="row">
                        <div class="col-sm-6">
                        <?php
                            $productos = Producto::find()->all();
---
SELECT * FROM `producto`