gestion/models/Cliente.php

    public function getClienteRol()
    {
      $clienteRol = ClienteRol::find()->where(['cliente_id' => $this->id])->andWhere(['<>','rol_id', Rol::DEFAULTROLID])->one();
      if (!empty($clienteRol)) {
        $rol_id = $clienteRol->rol_id;
      }else{
        $rol_id = $this->newClienteRol($this->id);
      }
      return Rol::find()->where(['id' => $rol_id ])->one();
---
SELECT * FROM `cliente_rol` WHERE (`cliente_id`=1) AND (`rol_id` <> 1)
SELECT EXISTS(SELECT * FROM `rol` WHERE (`rol`.`id`=2))
SELECT * FROM `rol` WHERE `id`=2

    public static function getTotalClientes()
    {
        return Cliente::find()->count();
---
SELECT COUNT(*) FROM `cliente`

    private function newClienteRol($cliente_id)
    {
      $modelRol = new Rol();
      $modelRol->nombre = "r$cliente_id";
      $modelRol->save();

      //seteo la relacion entre el rol y el cliente
      $modelClienteRol = new ClienteRol();
      $modelClienteRol->cliente_id = $cliente_id;
      $modelClienteRol->rol_id = $modelRol->id;
      $modelClienteRol->save();
---
INSERT INTO `rol` (`nombre`) VALUES ('r1')
INSERT INTO `cliente_rol` (`cliente_id`, `rol_id`) VALUES (1, 2)

    public function getVendedor(){
       $vendedor = User::find()->where(['id' => $this->viajante_id])->one();
---
SELECT EXISTS(SELECT * FROM `cliente` WHERE (`cliente`.`id`=1))