gestion/models/Comanda.php

    public static function getEstadoComanda()
    {
        $fecha = new \DateTime('today');
        $fecha = $fecha->format('Y-m-d');
        return Comanda::find()->where(['>=','fecha_produccion' , $fecha ])->one();
---
SELECT * FROM `comanda` WHERE `fecha_produccion` >= '2018-06-05'