gestion/models/Pedido.php

SELECT * FROM `cliente` WHERE `id`='5'
---
    public function getContacto()
    {
      $modelCliente = Cliente::find()->where(['id' => $this->cliente_id])->one();

SELECT COUNT(*) FROM `pedido` WHERE (`comanda_id` IS NULL) AND ((`estado`='Manual') OR (`estado`='processing'))
---
    public static function getTotalPedidosPendientes()
    {
       return Pedido::find()->where(['comanda_id' => null])
                            ->andWhere(['or',['estado'=> Pedido::ESTADO_MANUAL],
                                             ['estado'=> Pedido::ESTADO_PROCESANDO]
                                       ])->count();