gestion/models/ProductoRolQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `producto_rol` WHERE `rol_id` IN (1, 3)

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `producto_rol` WHERE (`producto_id`=1) AND (`rol_id`=1)