gestion/models/Producto.php

    public static function getTotalProductos()
    {
        return Producto::find()->count();
---
SELECT COUNT(*) FROM `producto`